// =====            Домашка 26.09.22
//Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и 
//возводит число A в натуральную степень B.
//3, 5 -> 243 (3⁵)      2, 4 -> 16
// Console.WriteLine("Введите число A: ");
// double A = double.Parse(Console.ReadLine()!);
// Console.WriteLine("Введите число B: ");
// double B = double.Parse(Console.ReadLine()!);
// double resalt = Math.Pow(A, B);
// Console.WriteLine(resalt);
 



//=Задача 27:
// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11      82 -> 10        9012 -> 12
Console.WriteLine("Введите число: ");
double A = double.Parse(Console.ReadLine()!);

















































































void Method1() 
{
     Console.WriteLine("С уважением Евгений Ткаченко!");
}
Method1();